#Задача 1

num1 = 25
num2 = 4
total = num1 + num2
difference = num1 - num2
product = num1 * num2
division = num1 / num2
remainder = num1 % num2

print("Число 1: " + str(num1))
print("Число 2: " + str(num2))
print("Сумма: " + str(total))
print("Разность: " + str(difference))
print("Произведение: " + str(product))
print("Деление: " + str(division))
print("Остаток: " + str(remainder))

#Задача 2

length = 5
width = 4
s = length * width
price = 500
total = price * s

print("Длина комнаты: " + str(length) + " м")
print("Ширина комнаты: " + str(width) + " м")
print("Площадь: " + str(s) + " м²")
print("Если плитка стоит " + str(price) + " рублей за м², то общая стоимость: " + str(total) + " рублей")

#Задача 3
name = "Богдан"
age = 15
year = 2011
year_sum = 2030 - year
day = 2
hours = 4 * day
print("Имя: " + name)
print("Возраст: " + str(age))
print("Год рождения: " + str(year))
print("В 2030 мне будет: " + str(year_sum))
print("Я учусь " + str(day) + " день, это " + str(hours) + " часов практики")